/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "blog-hero": {
      "type": "blog-hero",
      "settings": {
        "hero_image": "shopify://shop_images/IMG_7684_jpg.webp",
        "hero_height": 500
      }
    },
    "blog-posts": {
      "type": "blog-posts-grid",
      "blocks": {
        "post-1": {
          "type": "blog_post",
          "settings": {
            "post_image": "shopify://shop_images/PXL_20250704_131935861_jpg.webp",
            "post_title": "Yes, Kids Can Do Hard Things",
            "post_excerpt": "Griffin (12) and Grayson (9) sailed their new Topaz Taz from Emerald Isle to Long Island on their own. They capsized, righted the boat together, and made it home—proud, confident, and grinning ear to ear. No screen time has ever done that. Let's say yes to adventure. Let's trust our kids more. Let's give them the tools to do real, hard, unforgettable things.",
            "post_link": "/pages/blog-yes-kids-can-do-hard-things",
            "button_text": "Read More"
          }
        },
        "post-2": {
          "type": "blog_post",
          "settings": {
            "post_image": "shopify://shop_images/Untitled-202_png.webp",
            "post_title": "Hooked by the Truth: What it's like Being a Small Sailboat Dealer in a Big Fish Industry",
            "post_excerpt": "Being a small dealer is hard. Being a small sailboat dealer? It's damn near impossible. If it weren't for kayaks, Trusty Sail & Paddle wouldn't still be afloat. Here's the raw truth about what it's like being a small dealer in an industry that forgot us.",
            "post_link": "/pages/blog-hooked-by-the-truth",
            "button_text": "Read More"
          }
        },
        "post-3": {
          "type": "blog_post",
          "settings": {
            "post_image": "shopify://shop_images/IMG_7684_jpg.webp",
            "post_title": "Proudly Paddling Forward: The Power of Choosing American-Made Kayaks",
            "post_excerpt": "When you buy a Made in USA kayak, you're not just purchasing gear—you're investing in American values. From innovation and craftsmanship to environmental stewardship, American-made kayaks embody the resilience and spirit that define our country.",
            "post_link": "/pages/blog-american-made-kayaks",
            "button_text": "Read More"
          }
        },
        "post-4": {
          "type": "blog_post",
          "settings": {
            "post_image": "shopify://shop_images/IMG_7684_jpg.webp",
            "post_title": "Reviving Connection: The Essential Role of Independent Specialty Retailers in Our Communities",
            "post_excerpt": "Independent specialty retailers aren't just places to shop—they're spaces where people gather, share, and connect. In a world where so much is automated and impersonal, we remind you of the power of human connection and the value of a community that cares.",
            "post_link": "/pages/blog-specialty-retailers",
            "button_text": "Read More"
          }
        },
        "post-5": {
          "type": "blog_post",
          "settings": {
            "post_image": "shopify://shop_images/IMG_3697_jpg.webp",
            "post_title": "Every Story Matters: Embracing the Gift of Genuine Customer Interactions",
            "post_excerpt": "When customers apologize for 'taking up my time,' my response is always the same: 'There is nothing I would rather be doing.' Every interaction is a privilege. None of you have ever stolen my time—you've given me gifts of knowledge, experience, and insights that have enriched my life beyond measure.",
            "post_link": "/pages/blog-every-story-matters",
            "button_text": "Read More"
          }
        }
      },
      "block_order": [
        "post-1",
        "post-2",
        "post-3",
        "post-4",
        "post-5"
      ],
      "settings": {
        "background_color": "#e8f4f8"
      }
    }
  },
  "order": [
    "blog-hero",
    "blog-posts"
  ]
}
